In [1]:
import numpy as np
import pandas as pd

In [2]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [4]:
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [5]:
# create dataset using numpy
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01 -1.334710  0.182589 -1.040492 -0.174351
2013-01-02  0.053463 -3.428120  1.245824 -0.814897
2013-01-03  0.317707  1.413521 -1.810060 -1.178618
2013-01-04 -0.307419  0.839363 -0.723073 -1.404684
2013-01-05 -1.926522 -0.943379 -1.000761  0.141018
2013-01-06  2.165504 -0.712453 -0.375344  0.203907

In [6]:
df2 = pd.DataFrame(
  {
    "A": 1.0,
    "B": pd.Timestamp("20130102"),
    "C": pd.Series(1, index=list(range(4)), dtype="float32"),
    "D": np.array([3] * 4, dtype="int32"),
    "E": pd.Categorical(["test", "train", "test", "train"]),
    "F": "foo",
  }
)

df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [7]:
df2.dtypes

A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object

In [8]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [9]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [11]:
df

                   A         B         C         D
2013-01-01 -1.334710  0.182589 -1.040492 -0.174351
2013-01-02  0.053463 -3.428120  1.245824 -0.814897
2013-01-03  0.317707  1.413521 -1.810060 -1.178618
2013-01-04 -0.307419  0.839363 -0.723073 -1.404684
2013-01-05 -1.926522 -0.943379 -1.000761  0.141018
2013-01-06  2.165504 -0.712453 -0.375344  0.203907

In [10]:
# convert to numpy
df.to_numpy()

array([[-1.33471023,  0.18258865, -1.04049216, -0.17435102],
       [ 0.05346267, -3.42812021,  1.24582354, -0.81489699],
       [ 0.31770662,  1.41352056, -1.81006049, -1.17861815],
       [-0.30741945,  0.83936318, -0.72307275, -1.40468431],
       [-1.92652247, -0.94337852, -1.00076054,  0.14101822],
       [ 2.16550408, -0.71245311, -0.37534404,  0.20390659]])

In [12]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.171996 -0.441413 -0.617318 -0.537938
std    1.428506  1.715599  1.028569  0.690208
min   -1.926522 -3.428120 -1.810060 -1.404684
25%   -1.077888 -0.885647 -1.030559 -1.087688
50%   -0.126978 -0.264932 -0.861917 -0.494624
75%    0.251646  0.675170 -0.462276  0.062176
max    2.165504  1.413521  1.245824  0.203907

In [13]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -1.334710    0.053463    0.317707   -0.307419   -1.926522    2.165504
B    0.182589   -3.428120    1.413521    0.839363   -0.943379   -0.712453
C   -1.040492    1.245824   -1.810060   -0.723073   -1.000761   -0.375344
D   -0.174351   -0.814897   -1.178618   -1.404684    0.141018    0.203907

In [14]:
# sorting
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01 -0.174351 -1.040492  0.182589 -1.334710
2013-01-02 -0.814897  1.245824 -3.428120  0.053463
2013-01-03 -1.178618 -1.810060  1.413521  0.317707
2013-01-04 -1.404684 -0.723073  0.839363 -0.307419
2013-01-05  0.141018 -1.000761 -0.943379 -1.926522
2013-01-06  0.203907 -0.375344 -0.712453  2.165504

In [15]:
df.sort_index(axis=0, ascending=False)

                   A         B         C         D
2013-01-06  2.165504 -0.712453 -0.375344  0.203907
2013-01-05 -1.926522 -0.943379 -1.000761  0.141018
2013-01-04 -0.307419  0.839363 -0.723073 -1.404684
2013-01-03  0.317707  1.413521 -1.810060 -1.178618
2013-01-02  0.053463 -3.428120  1.245824 -0.814897
2013-01-01 -1.334710  0.182589 -1.040492 -0.174351

In [16]:
df.sort_values(by="B")

                   A         B         C         D
2013-01-02  0.053463 -3.428120  1.245824 -0.814897
2013-01-05 -1.926522 -0.943379 -1.000761  0.141018
2013-01-06  2.165504 -0.712453 -0.375344  0.203907
2013-01-01 -1.334710  0.182589 -1.040492 -0.174351
2013-01-04 -0.307419  0.839363 -0.723073 -1.404684
2013-01-03  0.317707  1.413521 -1.810060 -1.178618

In [17]:
df.sort_values(by=["B", "A"])

                   A         B         C         D
2013-01-02  0.053463 -3.428120  1.245824 -0.814897
2013-01-05 -1.926522 -0.943379 -1.000761  0.141018
2013-01-06  2.165504 -0.712453 -0.375344  0.203907
2013-01-01 -1.334710  0.182589 -1.040492 -0.174351
2013-01-04 -0.307419  0.839363 -0.723073 -1.404684
2013-01-03  0.317707  1.413521 -1.810060 -1.178618

## Selection

In [19]:
df

                   A         B         C         D
2013-01-01 -1.334710  0.182589 -1.040492 -0.174351
2013-01-02  0.053463 -3.428120  1.245824 -0.814897
2013-01-03  0.317707  1.413521 -1.810060 -1.178618
2013-01-04 -0.307419  0.839363 -0.723073 -1.404684
2013-01-05 -1.926522 -0.943379 -1.000761  0.141018
2013-01-06  2.165504 -0.712453 -0.375344  0.203907

In [18]:
df[['A', 'B']]

                   A         B
2013-01-01 -1.334710  0.182589
2013-01-02  0.053463 -3.428120
2013-01-03  0.317707  1.413521
2013-01-04 -0.307419  0.839363
2013-01-05 -1.926522 -0.943379
2013-01-06  2.165504 -0.712453

In [20]:
df[2:3]

                   A         B        C         D
2013-01-03  0.317707  1.413521 -1.81006 -1.178618

In [23]:
df.iloc[0:3, 0:2]

                   A         B
2013-01-01 -1.334710  0.182589
2013-01-02  0.053463 -3.428120
2013-01-03  0.317707  1.413521

In [27]:
df.loc[:, ['A', 'B']]

                   A         B
2013-01-01 -1.334710  0.182589
2013-01-02  0.053463 -3.428120
2013-01-03  0.317707  1.413521
2013-01-04 -0.307419  0.839363
2013-01-05 -1.926522 -0.943379
2013-01-06  2.165504 -0.712453

In [28]:
# getting 3rd row
df.iloc[3]

A   -0.307419
B    0.839363
C   -0.723073
D   -1.404684
Name: 2013-01-04 00:00:00, dtype: float64